package org.riflemansd.autocomplete;

/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */



import java.awt.BorderLayout;
import java.awt.GridLayout;
import javax.swing.JButton;
import javax.swing.JComboBox;
import javax.swing.JFrame;
import javax.swing.JPanel;

/**
 *
 * @author RiflemanSD
 */
public class Test extends JFrame {
    private String[] words = {"abds", "ABOUT", "About", "about", "abc", "Hello", "World", "war", "word", "lakis", "luck", "lakis2", "between", "wow", "warrior", "world", "wombocombo"};
    private String[] greekWords = {"Σωτήρης", "Κώστας", "Δημήτρης", "Γιώργος", "Γιάννης", "Σάββας", "Κωνσταντίνος", "Χαράλαμπος", "Μάρκος", "Μαρία", "Σωτηρία", "Δήμητρα", "ΣΩΤΗΡΗΣ"};
    
    public Test() {
        this.setSize(250, 300);
        this.setLayout(new BorderLayout());
        
        JPanel p = new JPanel();
        p.setLayout(null);
        
        String[] pefka = {
"Παλαμά",
"Φιλοθέου",
"Κωνσταντινουπόλεως",
"Αγίας Σοφίας",
"Ευαγγελισμού",
"Αναλήψεως",
"Βότση",
"Μεγαλόχαρης",
"Ρόδων",
"Σωτήρος",
"Νηρηίδων",
"Αναξαγόρα",
"Τοσίτσα",
"Παπάφη",
"Μαβίλη",
"Ζάππα",
"Αγίου Βασιλείου",
"Καραολή",
"Ολυμπιάδος",
"Πτολεμαίων",
"Ειρήνης",
"Πεντηκοστής",
"Δημοσθένους",
"Ρίτσου",
"Ελευθερίας",
"Θουκιδίδου",
"Βεργίνας",
"Νεφέλης",
"Δάφνης",
"Γαλήνης",
"Θάλειας",
"Σωκράτους",
"Βάρναλη",
"Ελύτη",
"Γκολέμη",
"Μαρίας Κάλλας",
"Λεωφόρος Παπανικολάου",
"Γρυπάρη",
"Αναγεννήσεως",
"Κ. Ουράνη",
"Μικράς Ασίας",
"Κατίνας Παξινού",
"Δημοτικό Γήπεδο Καλαθοσφαίριση",
"Μελωδίας",
"Πανδρόσου",
"Σμύρνης",
"Ανοίξεως",
"Ζωγράφου",
"Σεφέρη",
"Ελλησπόντου",
"Κερασούντος",
"Ελπίδος",
"Άη Γιώργη",
"Περιφερειακή Οδός",
"Ερμού",
"Αγίας Κυριακής",
"Γιασεμιών",
"Φιλίππου",
"Κολοκοτρώνη",
"Λέοντος Σοφού",
"Ξενοφώντος",
"Αγίων Πάντων",
"Σικελιανού",
"Βούλγαρη",
"Αμύντα",
"Πλάτωνος",
"Τσιμισκή",
"Χρυσανθέμων",
"Καβάφη",
"Ποιήσεως",
"Καραϊσκάκη",
"Πέλλης",
"Αρετής",
"Ζωής Καρέλη",
"Πάροδος Γρυπάρη",
"Αγραμπέλης",
"Απόλλωνος",
"Κερκίνης",
"Δαρδανελλίων",
"Αφροδίτης",
"Κομηνών",
"Εμμανουήλ Παππά",
"Αγίας Τριάδος",
"Σόλωνος",
"Κοιμήσεως Θεοτόκου",
"Αριστοτέλους",
"Ησιόδου",
"Ευτυχίας",
"Κρυστάλλη",
"Δελασάλ",
"Ιπποδρομίου",
"Παπανικολάου",
"Μαρμαρά",
"Προφήτη Ηλία",
"Μπενάκη",
"Αρσάκη",
"Γλυκοφιλούσας",
"Δίου",
"Μεγάλου Αλεξάνδρου",
"Ιουστινιανού",
"Ισαύρων",
"Νερομύλων",
"Αγία Τριάδα",
"Σεϊχ Σου",
"Ηρακλείτου",
"Ελάτης",
"Ανθέων",
"Εφέσσου",
"Αλεξάνδρειας",
"Ευκλείδη",
"Πλουτάρχου",
"Αναξιμάνδρου",
"Ομήρου",
"Αμαράντων",
"Προπύλαιων",
"Ανδρούτσου",
"Παναθήναιων",
"Δανάης",
"Βοσπόρου",
"Αθηνάς",
"Αρτέμιδος",
"Εσπερίδων",
"ΣΟΛΩΜΟΥ",
"Σουλίου",
"Αγίου Δημητρίου",
"Ελπίδας",
"Θεσσαλίας",
"Ήρας",
"Αγίου Γεωργίου",
"Ζωοδόχου Πηγής",
"Περγάμου",
"Καλλιρόης",
"Ονείρων",
"Αύρας",
"Ζεφύρων",
"Κεραμικού",
"Παλαιολόγων",
"Αγγέλων",
"Παναγίας Φανερωμένης",
"Προποντίδας",
"Ρωμανού Μελωδού",
"Βελισσαρίου",
"Οικισμός Βυζάντιο",
"Καππαδοκίας",
"Χάλκης",
"Καισαρείας",
"Αλικαρνασσού",
"Τενέδου",
"Οικισμός Πηγών",
"Καρυάτιδων",
"Εθνικής Αντιστάσεως",
"Μακεδονίας",
"Οικισμός Παράδεισος",
"Οικισμός Ακροπόλεως",
"Ξεροπόταμος",
"Ελληνικό Παιδικό Χωριό",
"Κλεισθένους",
"Ιπποκράτους",
"Δημοκρατίας",
"Θησέως",
"Πινδάρου",
"Ακροπόλεως",
"Κήπων",
"Μπότσαρη",
"Πανσέληνου",
"Αρχιμήδη",
"Λεμονανθών",
"Αισχύλου",
"Ισοκράτους",
"Διαγόρα",
"Λεύκης",
"Καρατάσου",
"Ακαδημίας",
"Χώρος αθλητικών εγκαταστάσεων",
"Μεταμορφώσεως",
"Οικισμός Αγίας Τριάδος",
"Δημοτικό Σχολείο",
"Σχολείων",
"Λύκειο",
"Πάροδος Τριών Ιεραρχών",
"Παιδικός Σταθμός",
"Γυμνάσιο",
"Τριών Ιεραρχών",
"Αγίου Φιλήμονος",
"Βαλαωρίτου",
"Πάροδος Ευαγγελισμού",
"Παιδική Χαρά Αγίας Τριάδος",
"Νηπιαγωγείο",
"Βαφοπούλου"};
        
        String[] my = {"Φόρος πολυτελείας στη Λεωφόρος φόρος φάρος"};
        
        JBoxAutoCompletePromptFasterWM box = new JBoxAutoCompletePromptFasterWM(pefka);
        //JBoxAutoCompletePrompt box = new JBoxAutoCompletePrompt(greekWords);
        
        AutoCompleteListener l = new AutoCompleteListener();
        box.addAutoCompleteListener(l);
        
        box.setBounds(10, 50, 300, 20);
        p.add(box);
        JComboBox box1 = new JComboBox();
        p.add(box1);
        
        this.add(p, BorderLayout.CENTER);
        this.setVisible(true);
        
        this.setSize(500, 200);
        this.setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);
    }
    
    public static void main(String[] args) {
        Test l = new Test();
        
//        for (int i = 0; i < 50; i++) {
//            //System.out.println((char)(i+97)); //97 - 123
//            //System.out.println((char)(i+65)); //65 - 91
//            System.out.println(i + " " + (char)(i+913)); //945 - 970
//            //913 - 937 χωρίς το 930
//        }
    }
}
